Autodesk.Revit.DB.FilterElementIdRule.UsesLevelFiltering(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
This function checks if a parameter uses level filtering.
Remarks:
When level-filtering parameters are compared, the comparisons will
first compare the values of the levels' elevations, then compare the
levels' names, and finally the levels' element ids to rank and sort the levels.
doc:
The document which owns the parameter.
parameterId:
The id of the parameter that will be tested to see if it uses level filtering.
Returns:
True if the parameter uses level filtering, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.FilterElementIdRule.RuleValue
The user-supplied value against which values from a Revit document will be tested.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.FilterElementIdRule.#ctor(Autodesk.Revit.DB.FilterableValueProvider,Autodesk.Revit.DB.FilterNumericRuleEvaluator,Autodesk.Revit.DB.ElementId)
Constructs an instance of FilterElementIdRule.
valueProvider:
A pointer to a "value provider" object that will extract values from a Revit document.
evaluator:
A pointer to the filter rule evaluator object that implements the desired test.
The built-in evaluators implement commonly used tests such as less-than, greater-than
less-than-or-equal-to, equal, etc.
ruleValue:
The user-supplied value against which values from a Revit document will be tested.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.FilterElementIdRule
A filter rule that operates on ElementId values in a Revit project.
Remarks:
When Autodesk.Revit.DB.FilterRule.GetRuleParameter returns a parameter
that Autodesk.Revit.DB.FilterElementIdRule.UsesLevelFiltering(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId),
then the comparisons will first compare the values of the levels' elevations, then compare
the levels' names, and finally the levels' element ids to rank and sort the levels.
Since:
2011